package ru.geekbrains.lesson2;

//public class HomeWorkTwo {
//    //1. Задать целочисленный массив, состоящий из элементов 0 и 1. Например: [ 1, 1, 0, 0, 1, 0, 1, 1, 0, 0 ]. С помощью цикла и условия заменить 0 на 1, 1 на 0;
//    public static void main (int n) {
//     int [] arr = new int[] {1, 0, 0, 1, 0, 0, 1, 1, 1, 0};
//     if (int i = 0; i = arr.length; i++) {
//            i = 1;}
//     if (int i = 1; i = arr.length; i++) {
//         i=0;}        }
//         //2. Задать пустой целочисленный массив размером 8. С помощью цикла заполнить его значениями 0 3 6 9 12 15 18 21;
//
//
//
//    }



