package ru.geekbrains.lesson1;

public class Homework {
    /*public static void main (String [] args) {
        System.out.println("Hi, everyone!");
    //Сначала попыталась сама сделать работу, потом посмотрела второй урок, чтобы разобрать решения. В целом, разобралась, но остались моменты, которые не пойму.
    // Ниже как я изначально сделала задания, если можно, прокомментируйте, пожалуйста.
    //Мой вариант ДЗ (выборочно)
    //Задание 3
    public static int numbers (int n ) {
        int a = 5;
        int b = 20;
        int c = (a + b - 5) * 2;
              return c;
        //Можно так решить?
    }

//Задание 4. Так можно решить?
    public static void numbersTow (int a, int b, int c ) {
        a = 10;
        b = 5;
        c = a + b;
        if ((c >= 10)&&(c <= 20)) {
            System.out.println("true");

        } else {
            System.out.println("false");
        }
    }
//         Задание 5
//       public static int numbers (int n ) {
//        if (number>=0){
//        System.out.println("Положительное число");
//    }
//        else {
//            System.out.println("Отрицательное число");


    // Ниже повторила по вашему разбору на уроке, но тоже остались вопросы.

    public static void hi(String[] args) {
        System.out.println("Hi, world");

        System.out.println(someThink(1, 4, 5, 10));
        printHelloName("Дима");
    }



    public static double someThink(double a, double b, double c, double d) {
        return a * (b + (c / d));

    }
    public static boolean inInterval (int a,int b){
        return (a + b >= 10) && (a + b <= 20);
    }
    //int n = 3;

    //Не пойму почему здесь не выводит в консоль "Положительное", т.е. выводит только одну строчку из всего документа.
    // Вообще ничего не выводит на печать...
    // Не понимаю, почему ругается на имена (желтая лампочка)
    int n = 3;
    public static void namberIsPositiveNumber (int n) {
       if (n >= 0)  {
            System.out.println("Положительное");
        }
        else {
            System.out.println("Отрицательное");
        }
    }
    public static boolean isNegativeNumber ( int n) {
        return n > 0;
    }
    // И здесь тоже не работает, в консоль не выводи...
    public static void printHelloName (String name){
        System.out.println( "Привет" + name + '!');
        System.out.printf( "Привет %s, ! \n %s, как дела?", name, name);

    }*/





}
